Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The statements until the matching ":endwhile" are executed for as long as the condition is true. The condition used here is the expression "i < 5". This is true when the variable i is smaller than five. Note: If you happen to write a while loop that keeps on running, you can interrupt it by pressing CTRL-C (CTRL-Break on MS-Windows).
es_es: Las instrucciones hasta el «:endwhile» correspondiente se ejecutan mientras que la {condicion} se siga cumpliendo. La condición aquí es la expresión «i < 5». Ésta es verdadera cuando la variable i es menor a cinco. Nota: Si llega a escribir un ciclo «while» que nunca termina de ejecutarse, puede interrumpirlo presionando CTRL-C (o CTRL-Break en MS-Windows).

source: The ":echo" command prints its arguments. In this case the string "count is" and the value of the variable i. Since i is one, this will print:
es_es: La orden «:echo» imprime en pantalla los argumentos que se le introduzcan. En este caso son la cadena «cuenta es» y el valor de la variable i. Como i vale uno, se imprimirá:

source: count is 1 ~
es_es: cuenta es 1 ~

source: Then there is the ":let i += 1" command. This does the same thing as ":let i = i + 1". This adds one to the variable i and assigns the new value to the same variable.
es_es: Luego está la orden «:let i += 1». Ésta tiene el mismo efecto que «:let i = i + 1». Le añade uno a la variable i y asigna el resultado a la misma variable.

source: :for i in range(1, 4) : echo "count is" i :endfor
es_es: :for i in range(1, 4) : echo "cuenta es" i :endfor

source: We won't explain how |:for| and |range()| work until later. Follow the links if you are impatient.
es_es: El funcionamiento de |:for| y |range()| se explicará después. Siga los enlaces si no desea esperar.

source: Numbers can be decimal, hexadecimal or octal. A hexadecimal number starts with "0x" or "0X". For example "0x1f" is decimal 31. An octal number starts with a zero. "017" is decimal 15. Careful: don't put a zero before a decimal number, it will be interpreted as an octal number! The ":echo" command always prints decimal numbers. Example: >
es_es: Los números pueden ser decimales, hexadecimales, u octales. Un número hexadecimal empieza con «0x» o «0X». Por ejemplo, «0x1f» es 31 en decimal. Un número octal empieza con cero. «017» es 15 en decimal. Tenga cuidado: no ponga ceros al comienzo de un número decimal, ¡será interpretado como un octal! La orden «:echo» siempre muestra los números como decimales. Ejemplo: >

source: A number is made negative with a minus sign. This also works for hexadecimal and octal numbers. A minus sign is also used for subtraction. Compare this with the previous example: >
es_es: Se pueden obtener números negativos añadiéndoles un signo de resta. Esto funciona también para números octales y hexadecimales. El signo menos también se usa para la substracción. Compare lo siguiente con el ejemplo anterior: >

source: White space in an expression is ignored. However, it's recommended to use it for separating items, to make the expression easier to read. For example, to avoid the confusion with a negative number above, put a space between the minus sign and the following number: >
es_es: En las expresiones se ignoran los espacios en blanco. Sin embargo, es recomendable usarlo para separar elementos, para hacer que las expresiones sean más legibles. Por ejemplo, para evitar confundir el ejemplo anterior con un número negativo, ponga un espacio entre el signo de resta y el número que lo sigue: >

source: A variable name consists of ASCII letters, digits and the underscore. It cannot start with a digit. Valid variable names are:
es_es: Los nombres de variables pueden consistir de las letras del código ASCII, dígitos, y el guión bajo. No pueden empezar con dígitos. Los siguientes son nombres válidos de variables:

source: counter _aap3 very_long_variable_name_with_underscores FuncLength LENGTH
es_es: contador _aap3 nombre_de_variable_largo_con_guion_bajo FuncLongitud LONGITUD

source: Invalid names are "foo+bar" and "6var". These variables are global. To see a list of currently defined variables use this command: >
es_es: «foo+bar» y «6var» no son nombres válidos. Estas variables son globales. Para ver un listado de las variables definidas actualmente, use la siguiente orden: >

source: :let s:count = 1 :while s:count < 5 : source other.vim : let s:count += 1 :endwhile
es_es: :let s:cuenta = 1 :while s:cuenta < 5 : source otro.vim : let s:cuenta += 1 :endwhile

source: Since "s:count" is local to this script, you can be sure that sourcing the "other.vim" script will not change this variable. If "other.vim" also uses an "s:count" variable, it will be a different copy, local to that script. More about script-local variables here: |script-variable|.
es_es: Ya que el ámbito de «s:cuenta» es local al script, puede estar seguro de que cargar el archivo «otro.vim» no hará cambios a dicha variable. Si «otro.vim» también usa una variable «s:cuenta», será una copia distinta, local al ámbito de ese script. Puede encontrar más información acerca de las variables locales a un script en |script-variable|.

source: There are more kinds of variables, see |internal-variables|. The most often used ones are:
es_es: Existen más clases de variables, consulte |internal-variables|. Las que se usan más frecuentemente son:

source: b:name variable local to a buffer w:name variable local to a window g:name global variable (also in a function) v:name variable predefined by Vim
es_es: b:nombre variable local a un búfer w:nombre variable local a una ventana g:nombre variable global (incluso dentro de funciones) v:nombre variable predeterminada por Vim

source: Variables take up memory and show up in the output of the ":let" command. To delete a variable use the ":unlet" command. Example: >
es_es: Las variables que aparecen en el listado que genera la orden «:let» consumen recursos de memoria. Para eliminar una variable use la orden «:unlet». Ejemplo: >

source: :unlet s:count
es_es: :unlet s:cuenta

source: This deletes the script-local variable "s:count" to free up the memory it uses. If you are not sure if the variable exists, and don't want an error message when it doesn't, append !: >
es_es: Esta orden elimina la variable «s:count», local al script actual, para liberar la memoria que ésta usa. Si no está seguro de que una variable exista, y no quiere obtener mensajes de error si no existe, añada ! a la orden: >

source: :unlet! s:count
es_es: :unlet! s:cuenta

source: When a script finishes, the local variables used there will not be automatically freed. The next time the script executes, it can still use the old value. Example: >
es_es: Cuando la ejecución de un script termina, no se liberan automáticamente los recursos usados por sus variables locales. La próxima vez que se ejecute el script, los valores antiguos estarán disponibles. Ejemplo: >

source: :if !exists("s:call_count") : let s:call_count = 0 :endif :let s:call_count = s:call_count + 1 :echo "called" s:call_count "times"
es_es: :if !exists("s:cuenta_llamadas") : let s:cuenta_llamadas = 0 :endif :let s:cuenta_llamadas = s:cuenta_llamadas + 1 :echo "llamado" s:cuenta_llamadas "veces"

source: The "exists()" function checks if a variable has already been defined. Its argument is the name of the variable you want to check. Not the variable itself! If you would do this: >
es_es: La función «exists()» comprueba la existencia de una variable. Recibe como argumento el nombre de la variable a comprobar. ¡No la variable como tal! Si intenta esto: >

source: :if !exists(s:call_count)
es_es: :if !exists(s:cuenta_llamadas)

source: Then the value of s:call_count will be used as the name of the variable that exists() checks. That's not what you want. The exclamation mark ! negates a value. When the value was true, it becomes false. When it was false, it becomes true. You can read it as "not". Thus "if !exists()" can be read as "if not exists()". What Vim calls true is anything that is not zero. Zero is false. Note: Vim automatically converts a string to a number when it is looking for a number. When using a string that doesn't start with a digit the resulting number is zero. Thus look out for this: > :if "true" < The "true" will be interpreted as a zero, thus as false!
es_es: El valor de «s:cuenta_llamadas» se usará como el nombre de variable que exists() revisará. Ése no es el efecto esperado. El símbolo de exclamación ! niega un valor. Cuando un valor es verdadero, se vuelve falso. Cuando es falso, se vuelve verdadero. Puede leer este símbolo como «not» (negación lógica). Así, «if !exists()» se lee como «if not exists()». Vim considera como verdadero cualquier valor distinto de cero. Cero equivale a falso. Nota: Vim convierte las cadenas de texto a números de manera automática cuando se espera un número. Cuando se hace esta conversión con una cadena que no empieza con un dígito el número resultante es cero. Debido a esto, tenga cuidado con instrucciones como: > :if "verdadero" < en este caso, la cadena «verdadero» será interpretada como un cero, ¡y por tanto como falso!

source: So far only numbers were used for the variable value. Strings can be used as well. Numbers and strings are the basic types of variables that Vim supports. The type is dynamic, it is set each time when assigning a value to the variable with ":let". More about types in |41.8|. To assign a string value to a variable, you need to use a string constant. There are two types of these. First the string in double quotes: >
es_es: Hasta ahora sólo se han usado números como valores de variables. También es posible usar cadenas de texto. Los tipos básicos de variables que Vim soporta son números y cadenas. El tipo de cada variable es dinámico, y se fija cada vez que se asigna un valor a una variable mediante «:let». Refiérase a |41.8| para más información acerca de tipos. Para asignar un valor de tipo cadena a una variable, debe usar una constante de cadena. Hay dos tipos de estas constantes. El primero es la cadena con comillas dobles: >

source: :let name = "peter" :echo name < peter ~
es_es: :let nombre = "pedro" :echo nombre < pedro ~

source: :let name = "\"peter\"" :echo name < "peter" ~
es_es: :let nombre = "\"pedro\"" :echo nombre < "pedro" ~

source: :let name = '"peter"' :echo name < "peter" ~
es_es: :let nombre = '"pedro"' :echo nombre < "pedro" ~

source: Inside a single-quote string all the characters are as they are. Only the single quote itself is special: you need to use two to get one. A backslash is taken literally, thus you can't use it to change the meaning of the character after it. In double-quote strings it is possible to use special characters. Here are a few useful ones:
es_es: En una cadena de comillas sencillas todos los caracteres tienen solamente su significado literal. Sólo la comilla sencilla es especial: debe usar dos seguidas para obtener una dentro de una cadena. La barra inversa se considera literalmente, por lo que no es posible usarla para cambiar el significado del carácter después de ella. En las cadenas de comillas dobles es posible usar caracteres especiales. A continuación algunos de los más usados:

source: \t <Tab> \n <NL>, line break \r <CR>, <Enter> \e <Esc> \b <BS>, backspace \" " \\ \, backslash \<Esc> <Esc> \<C-W> CTRL-W
es_es: \t <Tab> \n <NL>, salto de línea \r <CR>, <Enter> \e <Esc> \b <BS>, retroceso \" " \\ \, barra inversa \<Esc> <Esc> \<C-W> CTRL-W

source: The last two are just examples. The "\<name>" form can be used to include the special key "name". See |expr-quote| for the full list of special items in a string.
es_es: Los últimos dos sólo son ejemplos. Se puede usar la forma «\<nombre>» para incluir la tecla «nombre». Consulte |expr-quote| para ver la lista completa de elementos especiales en una cadena de texto.

source: *41.3* Expressions
es_es: *41.3* Expresiones

source: Vim has a rich, yet simple way to handle expressions. You can read the definition here: |expression-syntax|. Here we will show the most common items. The numbers, strings and variables mentioned above are expressions by themselves. Thus everywhere an expression is expected, you can use a number, string or variable. Other basic items in an expression are:
es_es: Vim tiene una forma expresiva, pero sencilla, de manejar expresiones. Puede leer la definición aquí: |expression-syntax|. A continuación mostraremos algunos de los elementos más comunes. Los números, cadenas, y las variables mencionadas anteriormente son expresiones por sí mismas. Así que, en donde sea que se espere una expresión, puede usar un número, una cadena, o una variable. Otros de los elementos comunes en una expresión son:

source: $NAME environment variable &name option @r register
es_es: $NOMBRE variable de entorno &nombre opción @r registro

source: Examples: >
es_es: Ejemplos: >

source: :echo "The value of 'tabstop' is" &ts :echo "Your home directory is" $HOME :if @a > 5
es_es: :echo "El valor de 'tabstop' es" &ts :echo "Su directorio personal es" $HOME :if @a > 5

source: The &name form can be used to save an option value, set it to a new value, do something and restore the old value. Example: >
es_es: Puede usar la forma «&nombre» para guardar el valor de una opción, fijarla a un nuevo valor, hacer algo, y restaurar el valor original. Por ejemplo: >

source: :let save_ic = &ic :set noic :/The Start/,$delete :let &ic = save_ic
es_es: :let ic_orig = &ic :set noic :/El Principio/,$delete :let &ic = ic_orig

source: This makes sure the "The Start" pattern is used with the 'ignorecase' option off. Still, it keeps the value that the user had set. (Another way to do this would be to add "\C" to the pattern, see |/\C|.)
es_es: Con esto se asegura que el patrón «El Principio» se buscará con la opción 'ignorecase' desactivada. Sin embargo, se conserva y restaura el valor que el usuario definió para la opción. (Otra forma de hacer esta búsqueda es añadir «\C» al patrón, consulte |/\C|.)

source: It becomes more interesting if we combine these basic items. Let's start with mathematics on numbers:
es_es: Las cosas se hacen más interesantes si combinamos estos elementos básicos. Empecemos con operaciones matemáticas sobre números:

source: a + b add a - b subtract a * b multiply a / b divide a % b modulo
es_es: a + b adición a - b sustracción a * b multiplicación a / b división a % b módulo (residuo)

source: The usual precedence is used. Example: >
es_es: Se maneja la precendencia de operadores usual. Ejemplo: >

source: Grouping is done with braces. No surprises here. Example: >
es_es: Puede cambiar la precendencia de las operaciones usando paréntesis. Esto no es nada nuevo. Ejemplo: >

source: Strings can be concatenated with ".". Example: >
es_es: Puede unir cadenas usando «.». Ejemplo: >

source: When the ":echo" command gets multiple arguments, it separates them with a space. In the example the argument is a single expression, thus no space is inserted.
es_es: Cuando recibe varios argumentos, la orden «:echo» los muestra en pantalla separados con espacios. En el ejemplo anterior el argumento es una única expresión, por lo que no se insertan espacios.

source: If "a" evaluates to true "b" is used, otherwise "c" is used. Example: >
es_es: Si «a» se evalúa como verdadero, la expresión corresponderá a «b», y en caso contrario a «c». Ejemplo: >

source: :let i = 4 :echo i > 5 ? "i is big" : "i is small" < i is small ~
es_es: :let i = 4 :echo i > 5 ? "i es grande" : "i es pequeño" < i es pequeño ~

source: *41.4* Conditionals
es_es: *41.4* Estructuras de decisión

source: The ":if" commands executes the following statements, until the matching ":endif", only when a condition is met. The generic form is:
es_es: La orden «:if» ejecuta las órdenes a continuación de ella, hasta el «:endif» correspondiente, cuando se cumple la condición especificada. La forma genérica es:

source: :if {condition} {statements} :endif
es_es: :if {condicion} {instrucciones} :endif

source: Only when the expression {condition} evaluates to true (non-zero) will the {statements} be executed. These must still be valid commands. If they contain garbage, Vim won't be able to find the ":endif". You can also use ":else". The generic form for this is:
es_es: Las {instrucciones} se ejecutan únicamente cuando la expresión {condicion} es verdadera, esto es, diferente de cero. Dichas instrucciones deben ser órdenes válidas. Si las órdenes tienen errores de sintaxis, Vim no podrá encontrar el «:endif» correspondiente. También puede usar «:else». La forma genérica es:

source: :if {condition} {statements} :else {statements} :endif
es_es: :if {condicion} {instrucciones} :else {instrucciones} :endif

source: The second {statements} is only executed if the first one isn't. Finally, there is ":elseif":
es_es: El segundo grupo de {instrucciones} sólo se ejecuta si el primero no lo hace. Finalmente, está «:elseif»

source: :if {condition} {statements} :elseif {condition} {statements} :endif
es_es: :if {condicion} {instrucciones} :elseif {condicion} {instrucciones} :endif

source: This works just like using ":else" and then "if", but without the need for an extra ":endif". A useful example for your vimrc file is checking the 'term' option and doing something depending upon its value: >
es_es: Esta orden funciona como «:else» seguido de «:if», pero tiene la ventaja de no requerir un «:endif» adicional. Un ejemplo útil que podría usar en su archivo vimrc es comprobar la opción 'term' y ejecutar órdenes diferentes de acuerdo a su valor: >

source: :if &term == "xterm" : " Do stuff for xterm :elseif &term == "vt100" : " Do stuff for a vt100 terminal :else : " Do something for other terminals :endif
es_es: :if &term == "xterm" : " Configuración para xterm :elseif &term == "vt100" : " Configuración para la terminal vt100 :else : " Configuración para otras terminales :endif

source: We already used some of them in the examples. These are the most often used ones:
es_es: Ya hemos usado algunas de ellas en los ejemplos anteriores. A continuación listamos las más utilizadas:

source: a == b equal to a != b not equal to a > b greater than a >= b greater than or equal to a < b less than a <= b less than or equal to
es_es: a == b igual a a != b diferente de a > b mayor que a >= b mayor o igual a a < b menor que a <= b menor o igual a

source: The result is one if the condition is met and zero otherwise. An example: >
es_es: El resultado es uno si la condición se cumple, y cero en caso contrario. Por ejemplo: >

source: :if v:version >= 700 : echo "congratulations" :else : echo "you are using an old version, upgrade!" :endif
es_es: :if v:version >= 700 : echo "felicitaciones" :else : echo "¡está usando una versión vieja, actualícese!" :endif

source: The logic operators work both for numbers and strings. When comparing two strings, the mathematical difference is used. This compares byte values, which may not be right for some languages. When comparing a string with a number, the string is first converted to a number. This is a bit tricky, because when a string doesn't look like a number, the number zero is used. Example: >
es_es: Los operadores lógicos funcionan con números y con cadenas de texto. Al comparar dos cadenas, se trabaja con la diferencia matemática de las mismas. Esto compara valores de bytes, lo que para algunos idiomas puede no entregar resultados correctos. Al comparar cadenas con números, la cadena es convertida a un número antes de hacer la comparación. Debe tener en cuenta que, cuando el contenido de una cadena no se asemeja a un número, se usa el número cero. Ejemplo: >

source: :if 0 == "one" : echo "yes" :endif
es_es: :if 0 == "uno" : echo "sí" :endif

source: a =~ b matches with a !~ b does not match with
es_es: a =~ b coincide con a !~ b no coincide con

source: The left item "a" is used as a string. The right item "b" is used as a pattern, like what's used for searching. Example: >
es_es: El operando de la izquierda, «a», se trata como una cadena. El operando de la derecha, «b», se trata como un patrón para una búsqueda de texto. Ejemplo: >

source: :if str =~ " " : echo "str contains a space" :endif :if str !~ '\.$' : echo "str does not end in a full stop" :endif
es_es: :if str =~ " " : echo "str contiene un espacio" :endif :if str !~ '\.$' : echo "str no termina con punto final" :endif

source: Notice the use of a single-quote string for the pattern. This is useful, because backslashes would need to be doubled in a double-quote string and patterns tend to contain many backslashes.
es_es: Tenga en cuenta el uso de una cadena de comillas sencillas como patrón de búsqueda. En este caso es útil porque las barras inversas tendrían que insertarse por partida doble en una cadena de comillas dobles, y los patrones de búsqueda suelen contener muchas barras inversas.

source: The 'ignorecase' option is used when comparing strings. When you don't want that, append "#" to match case and "?" to ignore case. Thus "==?" compares two strings to be equal while ignoring case. And "!~#" checks if a pattern doesn't match, also checking the case of letters. For the full table see |expr-==|.
es_es: Al comparar cadenas se tiene en cuenta la opción 'ignorecase'. Si no desea este comportamiento, añada un «#» para diferenciar mayúsculas de minúsculas, o «?» para ignorar dicha diferencia. Así, «==?» compara dos cadenas sin diferenciar mayúsculas de minúsculas. «!~#» revisa la no coincidencia de un patrón, teniendo en cuenta diferencias de mayúsculas y minúsculas. Puede consultar la tabla completa de operadores de comparación en |expr-==|.

source: The ":while" command was already mentioned. Two more statements can be used in between the ":while" and the ":endwhile":
es_es: Ya hemos mencionado la orden «:while». Hay dos instrucciones adicionales que pueden usarse entre «:while» y el «:endwhile» correspondiente:

source: :continue Jump back to the start of the while loop; the loop continues. :break Jump forward to the ":endwhile"; the loop is discontinued.
es_es: :continue Salta hasta el inicio del ciclo «while»; el ciclo continúa. :break Salta hasta después del «:endwhile»; provoca la terminación del ciclo.

source: :while counter < 40 : call do_something() : if skip_flag : continue : endif : if finished_flag : break : endif : sleep 50m :endwhile
es_es: :while contador < 40 : call hacer_algo() : if opción_omitir : continue : endif : if opción_terminado : break : endif : sleep 50m :endwhile

source: The ":sleep" command makes Vim take a nap. The "50m" specifies fifty milliseconds. Another example is ":sleep 4", which sleeps for four seconds.
es_es: La orden «:sleep» hace que Vim tome una pausa. El argumento «50m» especifica una duración de 50 milisegundos. Otro ejemplo es «:sleep 4», que especifica una pausa de cuatro segundos.

source: *41.5* Executing an expression
es_es: *41.5* Ejecución de expresiones

source: So far the commands in the script were executed by Vim directly. The ":execute" command allows executing the result of an expression. This is a very powerful way to build commands and execute them. An example is to jump to a tag, which is contained in a variable: >
es_es: Hasta ahora, todas las órdenes mostradas han sido ejecutadas directamente por Vim. La orden «:execute» permite ejecutar el resultado de una expresión. Ésta es una forma poderosa de construir y ejecutar órdenes. Un ejemplo es saltar a una etiqueta, cuyo nombre está almacenado en una variable: >

source: :execute "tag " . tag_name
es_es: :execute "tag " . nombre_etiqueta
